# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33
width_multiple: 0.50

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv_maxpool, [24]] 
  - [-1, 1, ShuffleNetV2, [116,2]]
  - [-1, 3, ShuffleNetV2, [116,1]]
  - [-1, 1, ShuffleNetV2, [232,2]]
  - [-1, 7, ShuffleNetV2, [232,1]]
  - [-1, 1, ShuffleNetV2, [464,2]]
  - [-1, 3, ShuffleNetV2, [464,1]]
  - [-1, 1, SPPF, [1024,5]]


# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 7], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 21 (P5/32-large)

  - [[13, 16, 19], 1, Detect, [nc]] # Detect(P3, P4, P5)
